app/Controllers/Scli.php

    public function index()
    {
        $model = new ScliModel();
        $data = $model->findAll();
---
SELECT *
FROM `scli`