app/Controllers/Scli.php

    public function index(){
        $model = new ScliModel();
        $data = $model->select('cliente, nombre,rifci,clave')->findAll();
---
SELECT `cliente`, `nombre`, `rifci`, `clave`
FROM `scli`

    public function search($name = null)
    {
        // Crear una instancia del modelo ScliModel
        $model = new \App\Models\ScliModel();

        // Verificar si el parámetro $name está vacío
        if (empty($name)) {
            return $this->respond(["message" => "Nombre de búsqueda no proporcionado"], 400);
        }

        // Especificar los campos que deseas obtener
        $fields = ['cliente', 'nombre', 'rifci'];

        // Realizar la búsqueda en la base de datos y obtener solo los campos especificados
        $queryResult = $model->select($fields)
                             ->like('cliente', $name)
                             ->orLike('nombre', $name)
                             ->orLike('rifci', $name)
                             ->findAll();
---
SELECT `cliente`, `nombre`, `rifci`
FROM `scli`
WHERE `cliente` LIKE '%centro%' ESCAPE '!'
OR  `nombre` LIKE '%centro%' ESCAPE '!'
OR  `rifci` LIKE '%centro%' ESCAPE '!'