app/Controllers/Sinv.php

    public function index(){
        $model = new SinvModel();
        $data = $model->select('descrip, precio1')->findAll();
---
SELECT `descrip`, `precio1`, `id`
FROM `sinv`