app/Controllers/Sinv.php

SELECT `descrip`, `precio1`, `id`
FROM `sinv`
WHERE `precio1` IS NOT NULL
AND `precio1` > 0
 LIMIT 50
---
    public function index(){
        $model = new SinvModel();
        $data = $model->select('descrip, precio1,id')
                    ->where('precio1 IS NOT NULL')
                    ->where('precio1 >', 0)
                    ->findAll(50); // Mover el límite aquí

SELECT `descrip`, `precio1`, `id`
FROM `sinv`
WHERE `descrip` LIKE '%%acetaminofe%%' ESCAPE '!'
AND `precio1` IS NOT NULL
AND `precio1` > 0
 LIMIT 100
---
    public function search($name = null)
    {
        $model = new \App\Models\SinvModel();

        if ($name === null) {
            return $this->respond(["message" => "Nombre de búsqueda no proporcionado"], 400);
        }

        $queryResult = $model->select('descrip, precio1, id')
            ->like('descrip', '%' . $name . '%')
            ->where('precio1 IS NOT NULL')
            ->where('precio1 >', 0)
            ->findAll(100); // Mover el límite aquí