app/Controllers/Usuario.php

    public function index(){
        $model = new UsuarioModel();
        $data = $model->select('us_codigo, us_clave, us_nombre')->findAll();
---
SELECT `us_codigo`, `us_clave`, `us_nombre`
FROM `usuario`